I can not reproduce this issue. Have you tried with the example in `examples` directory?

### Init

```
11:48:58 in terraform-provider-slack/examples on  master [$?] 
➜ terraform init   

Initializing the backend...

Initializing provider plugins...
- Finding pablovarela/slack versions matching "~> 1.0"...
- Installing pablovarela/slack v1.1.17...
- Installed pablovarela/slack v1.1.17 (self-signed, key ID 739911EE0B3BB89C)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```
### Apply
```
11:49:18 in terraform-provider-slack/examples on  master [$?]
➜ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.slack_usergroup.by_id will be read during apply
  # (config refers to values not yet known)
 <= data "slack_usergroup" "by_id"  {
      + channels     = (known after apply)
      + description  = (known after apply)
      + handle       = (known after apply)
      + id           = (known after apply)
      + usergroup_id = (known after apply)
      + users        = (known after apply)
    }

  # data.slack_usergroup.by_name will be read during apply
  # (config refers to values not yet known)
 <= data "slack_usergroup" "by_name"  {
      + channels    = (known after apply)
      + description = (known after apply)
      + handle      = (known after apply)
      + id          = (known after apply)
      + name        = "TestGroup"
      + users       = (known after apply)
    }

  # slack_conversation.my_conversation will be created
  + resource "slack_conversation" "my_conversation" {
      + action_on_destroy = "archive"
      + created           = (known after apply)
      + creator           = (known after apply)
      + id                = (known after apply)
      + is_archived       = false
      + is_ext_shared     = (known after apply)
      + is_general        = (known after apply)
      + is_org_shared     = (known after apply)
      + is_private        = true
      + is_shared         = (known after apply)
      + name              = "my-conversation"
      + permanent_members = [
          + "U01D31S1GUE",
          + "U01DZK10L1W",
        ]
      + topic             = "some interesting topic"
    }

  # slack_usergroup.my_group will be created
  + resource "slack_usergroup" "my_group" {
      + description = "Test user group"
      + handle      = "test"
      + id          = (known after apply)
      + name        = "TestGroup"
      + users       = [
          + "U01D31S1GUE",
          + "U01DZK10L1W",
        ]
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + group_by_id   = {
      + channels     = (known after apply)
      + description  = (known after apply)
      + handle       = (known after apply)
      + id           = (known after apply)
      + name         = null
      + usergroup_id = (known after apply)
      + users        = (known after apply)
    }
  + group_by_name = {
      + channels     = (known after apply)
      + description  = (known after apply)
      + handle       = (known after apply)
      + id           = (known after apply)
      + name         = "TestGroup"
      + usergroup_id = null
      + users        = (known after apply)
    }

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

slack_usergroup.my_group: Creating...
slack_usergroup.my_group: Creation complete after 1s [id=S022GE79E9G]
data.slack_usergroup.by_id: Reading...
data.slack_usergroup.by_name: Reading...
slack_conversation.my_conversation: Creating...
data.slack_usergroup.by_name: Read complete after 0s [id=S022GE79E9G]
data.slack_usergroup.by_id: Read complete after 0s [id=S022GE79E9G]
slack_conversation.my_conversation: Creation complete after 1s [id=C0308U44YE7]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

group_by_id = {
  "channels" = toset([
    "C022NJWTP52",
  ])
  "description" = "Test user group"
  "handle" = "test"
  "id" = "S022GE79E9G"
  "name" = "TestGroup"
  "usergroup_id" = "S022GE79E9G"
  "users" = toset([
    "U01D31S1GUE",
    "U01DZK10L1W",
  ])
}
group_by_name = {
  "channels" = toset([
    "C022NJWTP52",
  ])
  "description" = "Test user group"
  "handle" = "test"
  "id" = "S022GE79E9G"
  "name" = "TestGroup"
  "usergroup_id" = "S022GE79E9G"
  "users" = toset([
    "U01D31S1GUE",
    "U01DZK10L1W",
  ])
}
```